import { Product } from '../types/Product';

export const headphones: Product[] = [
    {
        img: `${process.env.PUBLIC_URL}/images/assets/S 852.png`,
        title: "Apple BYZ S852I",
        price: 2927,
        rate: 4.7,
        description: "BYZ S852 - проводное аудиоустройство, благодаря которому можно прослушивать любимую музыку, не мешая окружающим. Вставные вакуумные амбушюры обладают высокой степенью звукоизоляции, что исключает образование посторонних шумов. Наушники имеют хорошие акустические параметры: сопротивление равняется 32 Ом ± 15 Ом. Размер динамика: 14,2 мм. Максимальная входная мощность: 10 мВт. Длина провода: 125 ± 0,3 см.",
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/earpods 1.png`,
        title: "Apple EarPods",
        price: 2327,
        rate: 4.5,
        description: "Проводная гарнитура Apple EarPods (3.5 mm) подключается к устройствам по кабелю с разъемом jack 3.5 мм. Динамические излучатели формируют направленный звук с четкой передачей деталей в частотном диапазоне 20-20000 Гц. Обтекаемая форма пластиковых вкладышей повторяет геометрию ушной раковины, что обеспечивает эргономичность в использовании Apple EarPods (3.5 mm) и отсутствие дискомфорта. Интегрированный микрофон на проводе четко передает голос собеседнику. Пульт позволяет регулировать громкость, управлять воспроизведением и звонками.",
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/earpods 2.png`,
        title: "Apple ЕarPods",
        price: 2327,
        rate: 4.5,
        description: "Проводная гарнитура Apple EarPods (3.5 mm) подключается к устройствам по кабелю с разъемом jack 3.5 мм. Динамические излучатели формируют направленный звук с четкой передачей деталей в частотном диапазоне 20-20000 Гц. Обтекаемая форма пластиковых вкладышей повторяет геометрию ушной раковины, что обеспечивает эргономичность в использовании Apple EarPods (3.5 mm) и отсутствие дискомфорта. Интегрированный микрофон на проводе четко передает голос собеседнику. Пульт позволяет регулировать громкость, управлять воспроизведением и звонками.",
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/S 852.png`,
        title: "Apple BYZ S852I",
        price: 2927,
        rate: 4.7,
        description: "BYZ S852 - проводное аудиоустройство, благодаря которому можно прослушивать любимую музыку, не мешая окружающим. Вставные вакуумные амбушюры обладают высокой степенью звукоизоляции, что исключает образование посторонних шумов. Наушники имеют хорошие акустические параметры: сопротивление равняется 32 Ом ± 15 Ом. Размер динамика: 14,2 мм. Максимальная входная мощность: 10 мВт. Длина провода: 125 ± 0,3 см.",
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/earpods 1.png`,
        title: "Apple EarPods",
        price: 2327,
        rate: 4.5,
        description: "Проводная гарнитура Apple EarPods (3.5 mm) подключается к устройствам по кабелю с разъемом jack 3.5 мм. Динамические излучатели формируют направленный звук с четкой передачей деталей в частотном диапазоне 20-20000 Гц. Обтекаемая форма пластиковых вкладышей повторяет геометрию ушной раковины, что обеспечивает эргономичность в использовании Apple EarPods (3.5 mm) и отсутствие дискомфорта. Интегрированный микрофон на проводе четко передает голос собеседнику. Пульт позволяет регулировать громкость, управлять воспроизведением и звонками.",
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/earpods 2.png`,
        title: "Apple ЕarPods",
        price: 2327,
        rate: 4.5,
        description: "Проводная гарнитура Apple EarPods (3.5 mm) подключается к устройствам по кабелю с разъемом jack 3.5 мм. Динамические излучатели формируют направленный звук с четкой передачей деталей в частотном диапазоне 20-20000 Гц. Обтекаемая форма пластиковых вкладышей повторяет геометрию ушной раковины, что обеспечивает эргономичность в использовании Apple EarPods (3.5 mm) и отсутствие дискомфорта. Интегрированный микрофон на проводе четко передает голос собеседнику. Пульт позволяет регулировать громкость, управлять воспроизведением и звонками.",
    },
];

export const wireless: Product[] = [
    {
        img: `${process.env.PUBLIC_URL}/images/assets/airpods.png`,
        title: "Apple Airpods",
        price: 9527,
        rate: 4.7,
        description: "test",
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/gerlax gh-04.png`,
        title: "GERLAX GH-04",
        price: 6527,
        rate: 4.7,
        description: `Bluetooth: 5.0
        Активное шумоподавление: Да
        Вес: 4 гр
        Влагозащита: Да
        Время работы: 5 ч
        Время работы в режиме разговора: 4 ч
        Емкость Аккумулятора Кейса: 45 мАч
        Комплектация: зарядный чехол, кабель Lightning/USB, документация
        Материал корпуса: Акрил, пластик
        Микрофон: Да
        Назначение: Обычные
        Особенности: Настраиваются в одно касание, Вызов голосового ассистента.
        Ответить/закончить разговор: Да
        Разъем наушников: Lightning
        Регулятор громкости: Да
        Тип крепления: Крепления на ушах
        Тип наушников: Вакуумные
        Тип подключения: Bluetooth
        Частотный диапазон: 20 Гц - 20000 Гц
        Чувствительность: 109 дБ`,
    },
    {
        img: `${process.env.PUBLIC_URL}/images/assets/borofone bo4.png`,
        title: "BOROFONE BO4",
        price: 7527,
        rate: 4.7,
        description: "Откройте для себя идеальное сочетание комфорта и высококачественного звука с наушниками беспроводными большими BOROFONE BO4. Эти блютуз наушники предоставят вам полную свободу движений без проводов, обеспечивая при этом превосходное звучание и глубокие басы. Наушники накладные BOROFONE BO4 идеально подходят для повседневного использования, будь то прогулка в парке или работа в офисе. Они оснащены встроенным микрофоном, который обеспечивает четкую передачу голоса, делая их отличным выбором для звонков и видеоконференций. Беспроводные наушники с микрофоном позволяют удобно управлять вызовами и музыкой, не доставая телефон из кармана.",
    },
];